<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"3d70b578c2b48f4c1e4c8e22cc5a39bc515b5969c17d1ecfbc55efdbf534e279","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #643 at https://github.com/cal-itp/data-infra/actions/runs/17807508999","plan_out_hash":"d81a29b2df49293817b8f1b023133d4d3b72c7369514b28417e401873977317e","plan_hash":"f05ad42981a39775dc06fbc2e223a9b2ddff7b5934defa7e21ee5cc301757fbd","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/gcs_to_gtfs_rt_command_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "GPom7A==" -> (known after apply)
!~      detect_md5hash      = "QKb0CgYRSIudX7dAKtCb8Q==" -> "different hash"
!~      generation          = 1758129838245091 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/gcs_to_gtfs_rt_command_operator.py"
!~      md5hash             = "QKb0CgYRSIudX7dAKtCb8Q==" -> (known after apply)
        name                = "plugins/operators/gcs_to_gtfs_rt_command_operator.py"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #643](https://github.com/cal-itp/data-infra/actions/runs/17807508999)